Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_repository.this["2019.ipfs.camp"] will be destroyed
  # (because key ["2019.ipfs.camp"] is not in for_each map)
  - resource "github_repository" "this" {
      - allow_auto_merge       = false -> null
      - allow_merge_commit     = true -> null
      - allow_rebase_merge     = true -> null
      - allow_squash_merge     = true -> null
      - archived               = false -> null
      - auto_init              = false -> null
      - branches               = [
          - {
              - name      = "2022"
              - protected = false
            },
          - {
              - name      = "courses-list"
              - protected = false
            },
          - {
              - name      = "feat/add-ipfs-404"
              - protected = false
            },
          - {
              - name      = "fix/migration"
              - protected = false
            },
          - {
              - name      = "master"
              - protected = false
            },
          - {
              - name      = "timeline"
              - protected = false
            },
        ] -> null
      - default_branch         = "master" -> null
      - delete_branch_on_merge = false -> null
      - description            = "IPFS Camp 2019 Website" -> null
      - etag                   = "W/\"baf082067e54cb6e3bef7470e787c2bd568704b842a78dba50ba3abbc55af189\"" -> null
      - full_name              = "ipfs/2019.ipfs.camp" -> null
      - git_clone_url          = "git://github.com/ipfs/2019.ipfs.camp.git" -> null
      - has_downloads          = true -> null
      - has_issues             = true -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - homepage_url           = "https://camp.ipfs.io" -> null
      - html_url               = "https://github.com/ipfs/2019.ipfs.camp" -> null
      - http_clone_url         = "https://github.com/ipfs/2019.ipfs.camp.git" -> null
      - id                     = "2019.ipfs.camp" -> null
      - is_template            = false -> null
      - name                   = "2019.ipfs.camp" -> null
      - node_id                = "MDEwOlJlcG9zaXRvcnkxNzAxMTEzMDI=" -> null
      - private                = false -> null
      - repo_id                = 170111302 -> null
      - ssh_clone_url          = "git@github.com:ipfs/2019.ipfs.camp.git" -> null
      - svn_url                = "https://github.com/ipfs/2019.ipfs.camp" -> null
      - topics                 = [] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

  # github_repository.this["camp.ipfs.io"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = "master"
      + delete_branch_on_merge = false
      + description            = "IPFS Camp 2019 Website"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "camp.ipfs.io"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

  # github_repository_collaborator.this["2019.ipfs.camp:cwaring"] will be destroyed
  # (because key ["2019.ipfs.camp:cwaring"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "2019.ipfs.camp:cwaring" -> null
      - permission = "admin" -> null
      - repository = "2019.ipfs.camp" -> null
      - username   = "cwaring" -> null
    }

  # github_repository_collaborator.this["2019.ipfs.camp:lidel"] will be destroyed
  # (because key ["2019.ipfs.camp:lidel"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "2019.ipfs.camp:lidel" -> null
      - permission = "admin" -> null
      - repository = "2019.ipfs.camp" -> null
      - username   = "lidel" -> null
    }

  # github_repository_collaborator.this["2019.ipfs.camp:olizilla"] will be destroyed
  # (because key ["2019.ipfs.camp:olizilla"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "2019.ipfs.camp:olizilla" -> null
      - permission = "admin" -> null
      - repository = "2019.ipfs.camp" -> null
      - username   = "olizilla" -> null
    }

  # github_repository_collaborator.this["2019.ipfs.camp:web3-bot"] will be destroyed
  # (because key ["2019.ipfs.camp:web3-bot"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "2019.ipfs.camp:web3-bot" -> null
      - permission = "push" -> null
      - repository = "2019.ipfs.camp" -> null
      - username   = "web3-bot" -> null
    }

  # github_repository_collaborator.this["camp.ipfs.io:cwaring"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "camp.ipfs.io"
      + username                    = "cwaring"
    }

  # github_repository_collaborator.this["camp.ipfs.io:lidel"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "camp.ipfs.io"
      + username                    = "lidel"
    }

  # github_repository_collaborator.this["camp.ipfs.io:olizilla"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "camp.ipfs.io"
      + username                    = "olizilla"
    }

  # github_repository_collaborator.this["camp.ipfs.io:web3-bot"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "camp.ipfs.io"
      + username                    = "web3-bot"
    }

  # github_repository_collaborator.this["ecosystem-directory:tikagan"] will be destroyed
  # (because key ["ecosystem-directory:tikagan"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "ecosystem-directory:tikagan" -> null
      - permission = "maintain" -> null
      - repository = "ecosystem-directory" -> null
      - username   = "tikagan" -> null
    }

  # github_team_repository.this["Maintainers:2019.ipfs.camp"] will be destroyed
  # (because key ["Maintainers:2019.ipfs.camp"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"384b7c49252e5d75a94c76cbd6138a8f017cff3a3118d84c9ceefe67ca4c180e\"" -> null
      - id         = "3729031:2019.ipfs.camp" -> null
      - permission = "maintain" -> null
      - repository = "2019.ipfs.camp" -> null
      - team_id    = "3729031" -> null
    }

  # github_team_repository.this["Maintainers:camp.ipfs.io"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "camp.ipfs.io"
      + team_id    = "3729031"
    }

  # github_team_repository.this["WG GUI/UX:2019.ipfs.camp"] will be destroyed
  # (because key ["WG GUI/UX:2019.ipfs.camp"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"71f75a6562d4c16efd5c60d25b60ed2980ae564045c075630edab6d164332e5e\"" -> null
      - id         = "2825335:2019.ipfs.camp" -> null
      - permission = "push" -> null
      - repository = "2019.ipfs.camp" -> null
      - team_id    = "2825335" -> null
    }

  # github_team_repository.this["WG GUI/UX:camp.ipfs.io"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "camp.ipfs.io"
      + team_id    = "2825335"
    }

  # github_team_repository.this["admin:2019.ipfs.camp"] will be destroyed
  # (because key ["admin:2019.ipfs.camp"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"1d9ea37454df25a98eb9fe498d8844fb42c4514cafb5c42b24bd1c22cc715521\"" -> null
      - id         = "1516991:2019.ipfs.camp" -> null
      - permission = "admin" -> null
      - repository = "2019.ipfs.camp" -> null
      - team_id    = "1516991" -> null
    }

  # github_team_repository.this["admin:camp.ipfs.io"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "camp.ipfs.io"
      + team_id    = "1516991"
    }

  # github_team_repository.this["gui-dev:2019.ipfs.camp"] will be destroyed
  # (because key ["gui-dev:2019.ipfs.camp"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"71f75a6562d4c16efd5c60d25b60ed2980ae564045c075630edab6d164332e5e\"" -> null
      - id         = "6274133:2019.ipfs.camp" -> null
      - permission = "push" -> null
      - repository = "2019.ipfs.camp" -> null
      - team_id    = "6274133" -> null
    }

  # github_team_repository.this["gui-dev:camp.ipfs.io"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "camp.ipfs.io"
      + team_id    = "6274133"
    }

  # github_team_repository.this["gui-dev:in-web-browsers"] will be destroyed
  # (because key ["gui-dev:in-web-browsers"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"0f06233de6f48a6d66d1adb53829deb588458f5a31525d0e577ddf8ccf361c0a\"" -> null
      - id         = "6274133:in-web-browsers" -> null
      - permission = "maintain" -> null
      - repository = "in-web-browsers" -> null
      - team_id    = "6274133" -> null
    }

  # github_team_repository.this["gui-dev:public-gateway-checker"] will be updated in-place
  ~ resource "github_team_repository" "this" {
        id         = "6274133:public-gateway-checker"
      ~ permission = "maintain" -> "pull"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.this["ipdx:2019.ipfs.camp"] will be destroyed
  # (because key ["ipdx:2019.ipfs.camp"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"1d9ea37454df25a98eb9fe498d8844fb42c4514cafb5c42b24bd1c22cc715521\"" -> null
      - id         = "6349983:2019.ipfs.camp" -> null
      - permission = "admin" -> null
      - repository = "2019.ipfs.camp" -> null
      - team_id    = "6349983" -> null
    }

  # github_team_repository.this["ipdx:camp.ipfs.io"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "camp.ipfs.io"
      + team_id    = "6349983"
    }

  # github_team_repository.this["w3dt-stewards:2019.ipfs.camp"] will be destroyed
  # (because key ["w3dt-stewards:2019.ipfs.camp"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"1d9ea37454df25a98eb9fe498d8844fb42c4514cafb5c42b24bd1c22cc715521\"" -> null
      - id         = "4656983:2019.ipfs.camp" -> null
      - permission = "admin" -> null
      - repository = "2019.ipfs.camp" -> null
      - team_id    = "4656983" -> null
    }

  # github_team_repository.this["w3dt-stewards:camp.ipfs.io"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "camp.ipfs.io"
      + team_id    = "4656983"
    }

Plan: 11 to add, 1 to change, 13 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->